multiRegion_test/0/air/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    leftwall
    {
        type            calculated;
        value           uniform 100000;
    }
    rightwall
    {
        type            calculated;
        value           uniform 100000;
    }
    frontface
    {
        type            calculated;
        value           uniform 100000;
    }
    backface
    {
        type            calculated;
        value           uniform 100000;
    }
    air_to_heater
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_topplate
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_bottomplate
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
