multiRegion_test/0/bottomplate/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/bottomplate";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.01 0 0);

boundaryField
{
    leftwall
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    rightwall
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    bottomwall
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    frontface
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    backface
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    bottomplate_to_heater
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottomplate_to_air
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
