multiRegion_test/0/topplate/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topplate";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    topwall
    {
        type            calculated;
        value           uniform 100000;
    }
    leftwall
    {
        type            calculated;
        value           uniform 100000;
    }
    rightwall
    {
        type            calculated;
        value           uniform 100000;
    }
    frontface
    {
        type            calculated;
        value           uniform 100000;
    }
    backface
    {
        type            calculated;
        value           uniform 100000;
    }
    topplate_to_air
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
