multiRegion_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       5500;
    }
    leftwall
    {
        type            patch;
        nFaces          200;
        startFace       5700;
    }
    rightwall
    {
        type            patch;
        nFaces          200;
        startFace       5900;
    }
    bottomwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       6100;
    }
    frontface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       6300;
    }
    backface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       6400;
    }
)

// ************************************************************************* //
