multiRegion_test/constant/topplate/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/topplate/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       370;
    }
    leftwall
    {
        type            patch;
        nFaces          20;
        startFace       570;
    }
    rightwall
    {
        type            patch;
        nFaces          20;
        startFace       590;
    }
    frontface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       610;
    }
    backface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       620;
    }
    topplate_to_air
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       630;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_topplate;
    }
)

// ************************************************************************* //
